package com.lucky.jacklamb.utils;

import com.lucky.jacklamb.enums.Logo;
import com.lucky.jacklamb.ioc.config.Configuration;
import com.lucky.jacklamb.ioc.config.ScanConfig;

public class Jacklabm {
	
	private static ScanConfig sc;
	
	public static boolean first=true;
	
	public static void welcome() {
		if(!first)
			return;
		String d;
		sc=Configuration.getScanConfig();
		if(sc.getCustomLogo()!=null) {
			first=false;
			d=sc.getCustomLogo();
			System.out.println(d);
			System.out.println("\n--------------------------------------------------\n##\n## Lucky[NOXMLç‰ˆ]\n## (v1.0.0.RELEASE)\n##\n--------------------------------------------------\n\n");
			try {
				Thread.sleep(500);
			} catch (InterruptedException e) {
				e.printStackTrace();
			}
			return;
		}
		first=false;
		switch (sc.getLogo()) {
		case COMPUTER:
			d=str1();
			break;
		case KEYBOARD:
			d=str2();
			break;
		case MOUSELET:
			d=str3();
			break;
		case GRASS_MUD_HORSE:
			d=str4();
			break;
		case ANTS:
			d=str5();
			break;
		case SINGLE_WANG:
			d=str6();
			break;
		case DRAGON:
			d=str7();
			break;
		case BUDDHA:
			d=str8();
			break;
		default:
			d="";
		}
		System.out.println(d);
		if(sc.getLogo()!=Logo.MOUSELET&&sc.getLogo()!=Logo.KEYBOARD)
			System.out.println("\n--------------------------------------------------\n##\n## Lucky[NOXMLç‰ˆ]\n## (v1.0.0.RELEASE)\n##\n--------------------------------------------------\n\n");
		try {
			Thread.sleep(500);
		} catch (InterruptedException e) {
			e.printStackTrace();
		}
	}
	

	public static String exception(String titleinfo,String m1,String m2) {
		String exception="<!doctype html>" + 
				"<html lang=\"en\">" + 
				"<head>" + 
				"<title>"+titleinfo+"</title>" + 
				"<style type=\"text/css\">h1 {font-family:Tahoma,Arial,sans-serif;color:white;background-color:#525D76;font-size:22px;} h2 {font-family:Tahoma,Arial,sans-serif;color:white;background-color:#525D76;font-size:16px;} h3 {font-family:Tahoma,Arial,sans-serif;color:white;background-color:#525D76;font-size:14px;} body {font-family:Tahoma,Arial,sans-serif;color:black;background-color:white;} b {font-family:Tahoma,Arial,sans-serif;color:white;background-color:#525D76;} p {font-family:Tahoma,Arial,sans-serif;background:white;color:black;font-size:12px;} a {color:black;} a.name {color:black;} .line {height:1px;background-color:#525D76;border:none;}</style>" + 
				"</head>" + 
				"<body>" + 
				"<h1>"+titleinfo+"</h1>" + 
				"<hr class=\"line\" /><p><b>Type</b> Status Report</p>" + 
				"<p><b>Message</b> "+m1+"</p>" + 
				"<p><b>Description</b> "+m2+"</p>" + 
				"<hr class=\"line\" /><h3>JackLamb Lucky[noxml]/1.0.00</h3></body></html>";
		return exception;
	}
	
	public static String str1() {
		String d="     ,---------------------------------,      ,---------,\r\n" + 
				"         ,-----------------------,          ,\"        ,\"|\r\n" + 
				"      ,\"                      ,\" |        ,\"        ,\"  |\r\n" + 
				"      +-----------------------+  |      ,\"        ,\"    |\r\n" + 
				"      |  .-----------------.  |  |     +---------+      |\r\n" + 
				"      |  |                 |  |  |     | -==----'|      |\r\n" + 
				"      |  |  Lucky          |  |  |     |         |      |\r\n" + 
				"      |  |  version: 1.0.0 |  |  |/----|`---=    |      |\r\n" + 
				"      |  |  C:\\>_          |  |  |   ,/|==== ooo |      ;\r\n" + 
				"      |  |                 |  |  |  // | ((FK))  |    ,\"\r\n" + 
				"      |  '-----------------'  |,\" .;'| |((7075)) |  ,\"\r\n" + 
				"      +-----------------------+  ;;  | |         |,\"\r\n" + 
				"         /_)______________(_/  //'   | +---------+\r\n" + 
				"    ___________________________/___  `,\r\n" + 
				"   /  oooooooooooooooo  .o.  oooo /,   \\,\"-----------\r\n" + 
				"  / ==ooooooooooooooo==.o.  ooo= //   ,`\\--{:)     ,\"\r\n" + 
				" /_==__==========__==_ooo__ooo=_/'   /___________,\"\r\n\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n" ;
		return d;
	}
	
	public static String str2() {
		String d= " â”Œâ”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”\r\n" +
				" ï¿??                                         GitHub:FK7075                                              â”‚\r\n"+
				" ï¿??   â”Œâ”€ï¿??ï¿??ï¿??   â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿??                      â”‚\r\n" + 
				" ï¿??   â”‚Escï¿??   ï¿?? F1ï¿?? F2ï¿?? F3ï¿?? F4ï¿?? ï¿?? F5ï¿?? F6ï¿?? F7ï¿?? F8ï¿?? ï¿?? F9â”‚F10â”‚F11â”‚F12ï¿?? â”‚P/Sâ”‚S Lâ”‚P/Bï¿??  â”Œâ”    â”Œâ”    â”Œâ”      â”‚\r\n" + 
				" ï¿??   â””â”€ï¿??ï¿??ï¿??   â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??  â””â”˜    â””â”˜    â””â”˜      â”‚\r\n" + 
				" ï¿??   â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿??    â”‚\r\n" + 
				" ï¿??   â”‚~ `ï¿??! 1â”‚@ 2ï¿??# 3ï¿??$ 4ï¿??% 5â”‚^ 6ï¿??& 7ï¿??* 8ï¿??( 9ï¿??) 0â”‚_ -ï¿??+ =ï¿?? BacSp ï¿?? â”‚Insâ”‚Homâ”‚PUpï¿?? â”‚N Lï¿?? / ï¿?? * ï¿?? - ï¿??    â”‚\r\n" + 
				" ï¿??   â”œâ”€ï¿??ï¿??â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€ï¿??ï¿??ï¿??ï¿??ï¿?? â”œâ”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿?? â”œâ”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿??    â”‚\r\n" + 
				" ï¿??   ï¿?? Tab ï¿?? Q ï¿?? W ï¿?? E ï¿?? R ï¿?? T ï¿?? Y*ï¿?? U*ï¿?? I ï¿?? O ï¿?? P â”‚{ [â”‚} ]ï¿?? | \\ ï¿?? â”‚Delâ”‚Endâ”‚PDnï¿?? ï¿?? 7 ï¿?? 8 ï¿?? 9 ï¿??   ï¿??    â”‚\r\n" + 
				" ï¿??   â”œâ”€ï¿??ï¿??ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”¬ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿?? â”œâ”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿?? + ï¿??    â”‚\r\n" + 
				" ï¿??   ï¿?? Caps ï¿?? A ï¿?? S ï¿?? D ï¿?? F ï¿?? G ï¿?? H ï¿?? J ï¿?? K*ï¿?? L*ï¿??: ;â”‚\" 'ï¿?? Enter  ï¿??               ï¿?? 4 ï¿?? 5 ï¿?? 6 ï¿??   ï¿??    â”‚\r\n" + 
				" ï¿??   â”œâ”€ï¿??ï¿??ï¿??ï¿??ï¿??â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€â”¬â”€â”´â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??     â”Œâ”€ï¿??ï¿??ï¿??     â”œâ”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿??    â”‚\r\n" + 
				" ï¿??   ï¿?? Shift  ï¿?? Z ï¿?? X ï¿?? C*ï¿?? V ï¿?? B ï¿?? N ï¿?? M ï¿??< ,ï¿??> .ï¿??? /ï¿??  Shift   ï¿??     ï¿?? ï¿?? ï¿??     ï¿?? 1 ï¿?? 2 ï¿?? 3 ï¿??   ï¿??    â”‚\r\n" + 
				" ï¿??   â”œâ”€ï¿??ï¿??ï¿??ï¿??â”¬â”€ï¿??â”´â”€â”¬â”€â”´â”€ï¿??â”¬â”´ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??â”¬â”´ï¿??ï¿??ï¿??â”¼â”€ï¿??ï¿??â”´â”¬ï¿??ï¿??ï¿??ï¿??â”¬â”€ï¿??ï¿??ï¿??ï¿?? â”Œâ”€ï¿??ï¿??â”¼â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿?? â”œâ”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”¼â”€ï¿??ï¿??ï¿?? Eâ”‚â”‚    â”‚\r\n" + 
				" ï¿??   ï¿?? Ctrlï¿??    â”‚Alt ï¿??         Space         ï¿?? Altï¿??    ï¿??    â”‚Ctrlï¿?? ï¿?? ï¿?? ï¿?? ï¿?? ï¿?? ï¿?? ï¿?? ï¿??   0   ï¿?? . â”‚â†ï¿??â”˜â”‚    â”‚\r\n" + 
				" ï¿??   â””â”€ï¿??ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿?? â””â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”´â”€ï¿??ï¿??â”´â”€ï¿??ï¿??ï¿??    â”‚\r\n" + 
				" ï¿??                                     Lucky[NOXML]  (v1.0.0.RELEASE)                                 â”‚\r\n"+
				" â””â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”˜\r\n\n";
		return d;
	}
	
	public static String str3() {
		String d="--------------------------GitHubï¼šFK7075----------------------\n\n"+
				"            .--,       .--,\r\n" + 
				"           ( (  \\.---./  ) )\r\n" + 
				"            '.__/o   o\\__.'\r\n" + 
				"               {=  ^  =}\r\n" + 
				"                >  -  <\r\n" + 
				"               /       \\\r\n" + 
				"              //       \\\\\r\n" + 
				"             //|   .   |\\\\\r\n" + 
				"             \"'\\       /'\"_.-~^`'-.\r\n" + 
				"                \\  _  /--'         `\r\n" + 
				"              ___)( )(___\r\n" + 
				"             (((__) (__)))    Hello World!\r\n\n" + 
				"---------------------------Lucky[NOXMLç‰ˆ]------------------------\r";
		return d;
	}
	
	public static String str4() {
		String d="#         â”Œâ”€ï¿??       â”Œâ”€â”\r\n" + 
				"#      â”Œâ”€ï¿??ï¿?? â”´â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿?? â”´â”€ï¿??â”\r\n" + 
				"#      ï¿??                 â”‚\r\n" + 
				"#      ï¿??       ï¿??ï¿??ï¿??       â”‚\r\n" + 
				"#      ï¿??  ï¿??â”¬â”˜       â””â”¬ï¿??  â”‚\r\n" + 
				"#      ï¿??                 â”‚\r\n" + 
				"#      ï¿??       ï¿??â”´â”€       â”‚\r\n" + 
				"#      ï¿??                 â”‚\r\n" + 
				"#      â””â”€ï¿??ï¿??ï¿??         â”Œâ”€ï¿??ï¿??â”˜\r\n" + 
				"#          ï¿??         â”‚\r\n" + 
				"#          ï¿??         â”‚\r\n" + 
				"#          ï¿??         â”‚\r\n" + 
				"#          ï¿??         â””â”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”\r\n" + 
				"#          ï¿??                        â”‚\r\n" + 
				"#          ï¿??                        â”œâ”€â”\r\n" + 
				"#          ï¿??                        â”Œâ”€â”˜\r\n" + 
				"#          ï¿??                        â”‚\r\n" + 
				"#          â””â”€ï¿??  ï¿??  â”Œâ”€ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??â”¬â”€ï¿??ï¿??  â”Œâ”€ï¿??â”˜\r\n" + 
				"#            ï¿?? ï¿??ï¿?? ï¿??ï¿??       ï¿?? ï¿??ï¿?? ï¿??â”¤\r\n" + 
				"#            â””â”€ï¿??â”´â”€ï¿??ï¿??       â””â”€ï¿??â”´â”€ï¿??â”˜\r\n" + 
				"#                (: Hello World :)\n" + 
				"#                \r\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n";
		return d;
	}
	
	public static String str5() {
		String d="â–„â–„â–„â–„â–„\r\n" + 
				"            ï¿??ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„â–„ï¿??       _______________\r\n" + 
				"          â–„â–„â–„â–„ï¿??  â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„  /                 \\\r\n" + 
				"         ï¿??ï¿??ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–Œ ï¿??â–â–„ ï¿??â–â–ˆ |    Hello World   |\r\n" + 
				"       ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„ï¿?? ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„â–ˆï¿?? | _________________/\r\n" + 
				"       ï¿??â–„â–„â–„â–„ï¿??  ï¿??ï¿??â–ˆâ–„ï¿??â–ˆâ•â•â•â•â–ˆï¿?? |/\r\n" + 
				"            ï¿??ï¿??ï¿??ï¿??  ï¿??ï¿??â–ˆâ–ˆï¿?? ï¿??       â–„â–„\r\n" + 
				"         â–„â–ˆâ–ˆâ–ˆï¿??ï¿??â–ˆâ–ˆâ–„â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–„ â–„â–€ï¿??ï¿??ï¿??ï¿??ï¿??â–ˆâ–Œ   ______________________________ \r\n" + 
				"       â–ˆâ–ˆï¿??â–„â–„â–„â–ˆâ–ˆâ–€â–„â–ˆâ–ˆâ–ˆï¿?? ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆ      â–„â–ˆï¿??  ï¿??                               \\\\ \r\n" + 
				"    â–„â–€ï¿??ï¿??â–„â–ˆâ–ˆâ–„ï¿??ï¿??â–Œâ–ˆâ–ˆâ–ˆâ–ˆâ–’â–’â–’â–’â–’â–’â–ˆâ–ˆâ–ˆ     â–Œâ–„â–„â–€ï¿??ï¿??ï¿??â–ˆ_____________________________ //\r\n" + 
				"    ï¿??    â–â–€â–ˆâ–ˆâ–ˆâ–ˆâ–â–ˆâ–ˆâ–ˆâ–’â–’â–’â–’â–’â–â–ˆâ–ˆâ–Œ\r\n" + 
				"    ï¿??â–„â–„â–„â–„ï¿??   ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–’â–’â–’â–’â–„â–ˆâ–ˆâ–€\r\n" + 
				"              ï¿??ï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–€\r\n" + 
				"            â–„â–„â–ˆâ–ˆï¿??â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆï¿??â–ˆ\r\n" + 
				"          â–„â–ˆâ–ˆâ–€     ï¿??ï¿??ï¿??  â–ˆ\r\n" + 
				"         â–„â–ˆ             â–â–Œ\r\n" + 
				"     â–„â–„â–„â–„â–ˆâ–Œ              ï¿??â–ˆâ–„â–„â–„â–„â–€ï¿??â–„\r\n" + 
				"    ï¿??     ï¿??                ï¿??ï¿??â–„â–„â–„â–€\r\n" + 
				"     ï¿??ï¿??â–„â–„ï¿??     â–ˆâ–ˆ   \r\n" + 
				" \\  ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿?? ï¿?? \r\n" + 
				" \\- ï¿??       .....Follow Me.....           ï¿?? ï¿??      \r\n" + 
				"  - ï¿??                            (o)          ï¿?? \r\n" + 
				" /- ï¿??            Go Go Go !               ï¿?? ï¿??           \r\n" + 
				" /  ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿??ï¿?? ï¿??       \r\n" + 
				"               â–ˆâ–ˆ\r\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n";
		return d;
	}
	
	public static String str6() {
		String d="\r\n" + 
				"                       ::\r\n" + 
				"                      :;J7, :,                        ::;7:\r\n" + 
				"                      ,ivYi, ,                       ;LLLFS:\r\n" + 
				"                      :iv7Yi                       :7ri;j5PL\r\n" + 
				"                     ,:ivYLvr                    ,ivrrirrY2X,\r\n" + 
				"                     :;r@Wwz.7r:                :ivu@kexianli.\r\n" + 
				"                    :iL7::,:::iiirii:ii;::::,,irvF7rvvLujL7ur\r\n" + 
				"                   ri::,:,::i:iiiiiii:i:irrv177JX7rYXqZEkvv17\r\n" + 
				"                ;i:, , ::::iirrririi:i:::iiir2XXvii;L8OGJr71i\r\n" + 
				"              :,, ,,:   ,::ir@mingyi.irii:i:::j1jri7ZBOS7ivv,\r\n" + 
				"                 ,::,    ::rv77iiiriii:iii:i::,rvLq@huhao.Li\r\n" + 
				"             ,,      ,, ,:ir7ir::,:::i;ir:::i:i::rSGGYri712:\r\n" + 
				"           :::  ,v7r:: ::rrv77:, ,, ,:i7rrii:::::, ir7ri7Lri\r\n" + 
				"          ,     2OBBOi,iiir;r::        ,irriiii::,, ,iv7Luur:\r\n" + 
				"        ,,     i78MBBi,:,:::,:,  :7FSL: ,iriii:::i::,,:rLqXv::\r\n" + 
				"        :      iuMMP: :,:::,:ii;2GY7OBB0viiii:i:iii:i:::iJqL;::\r\n" + 
				"       ,     ::::i   ,,,,, ::LuBBu BBBBBErii:i:i:i:i:i:i:r77ii\r\n" + 
				"      ,       :       , ,,:::rruBZ1MBBqi, :,,,:::,::::::iiriri:\r\n" + 
				"     ,               ,,,,::::i:  @arqiao.       ,:,, ,:::ii;i7:\r\n" + 
				"    :,       rjujLYLi   ,,:::::,:::::::::,,   ,:i,:,,,,,::i:iii\r\n" + 
				"    ::      BBBBBBBBB0,    ,,::: , ,:::::: ,      ,,,, ,,:::::::\r\n" + 
				"    i,  ,  ,8BMMBBBBBBi     ,,:,,     ,,, , ,   , , , :,::ii::i::\r\n" + 
				"    :      iZMOMOMBBM2::::::::::,,,,     ,,,,,,:,,,::::i:irr:i:::,\r\n" + 
				"    i   ,,:;u0MBMOG1L:::i::::::  ,,,::,   ,,, ::::::i:i:iirii:i:i:\r\n" + 
				"    :    ,iuUuuXUkFu7i:iii:i:::, :,:,: ::::::::i:i:::::iirr7iiri::\r\n" + 
				"    :     :rk@Yizero.i:::::, ,:ii:::::::i:::::i::,::::iirrriiiri::,\r\n" + 
				"     :      5BMBBBBBBSr:,::rv2kuii:::iii::,:i:,, , ,,:,:i@petermu.,\r\n" + 
				"          , :r50EZ8MBBBBGOBBBZP7::::i::,:::::,: :,:,::i;rrririiii::\r\n" + 
				"              :jujYY7LS0ujJL7r::,::i::,::::::::::::::iirirrrrrrr:ii:\r\n" + 
				"           ,:  :@kevensun.:,:,,,::::i:i:::::,,::::::iir;ii;7v77;ii;i,\r\n" + 
				"           ,,,     ,,:,::::::i:iiiii:i::::,, ::::iiiir@xingjief.r;7:i,\r\n" + 
				"        , , ,,,:,,::::::::iiiiiiiiii:,:,:::::::::iiir;ri7vL77rrirri::\r\n" + 
				"         :,, , ::::::::i:::i:::i:i::,,,,,:,::i:i:::iir;@Secbone.ii:::\r\n" + 
				"\r\n" + 
				"--\r\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½??(: Hello World :)â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n";
		return d;
	}
	
	public static String str7() {
		String d="#\r\n" + 
				"#                  ___====-_  _-====___\r\n" + 
				"#            _--^^^#####//      \\\\#####^^^--_\r\n" + 
				"#         _-^##########// (    ) \\\\##########^-_\r\n" + 
				"#        -############//  |\\^^/|  \\\\############-\r\n" + 
				"#      _/############//   (@::@)   \\\\############\\_\r\n" + 
				"#     /#############((     \\\\//     ))#############\\\r\n" + 
				"#    -###############\\\\    (oo)    //###############-\r\n" + 
				"#   -#################\\\\  / VV \\  //#################-\r\n" + 
				"#  -###################\\\\/      \\//###################-\r\n" + 
				"# _#/|##########/\\######(   /\\   )######/\\##########|\\#_\r\n" + 
				"# |/ |#/\\#/\\#/\\/  \\#/\\##\\  |  |  /##/\\#/  \\/\\#/\\#/\\#| \\|\r\n" + 
				"# `  |/  V  V  `   V  \\#\\| |  | |/#/  V   '  V  V  \\|  '\r\n" + 
				"#    `   `  `      `   / | |  | | \\   '      '  '   '\r\n" + 
				"#                     (  | |  | |  )\r\n" + 
				"#                    __\\ | |  | | /__\r\n" + 
				"#                   (vvv(VVV)(VVV)vvv)\r\n\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½??(: Hello World :)â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n";
		return d;
	}
	
	public static String str8() {
		String d="#                       _oo0oo_\r\n" + 
				"#                      o8888888o\r\n" + 
				"#                      88\" . \"88\r\n" + 
				"#                      (| -_- |)\r\n" + 
				"#                      0\\  =  /0\r\n" + 
				"#                    ___/`---'\\___\r\n" + 
				"#                  .' \\\\|     |// '.\r\n" + 
				"#                 / \\\\|||  :  |||// \\\r\n" + 
				"#                / _||||| -:- |||||- \\\r\n" + 
				"#               |   | \\\\\\  -  /// |   |\r\n" + 
				"#               | \\_|  ''\\---/''  |_/ |\r\n" + 
				"#               \\  .-\\__  '-'  ___/-. /\r\n" + 
				"#             ___'. .'  /--.--\\  `. .'___\r\n" + 
				"#          .\"\" '<  `.___\\_<|>_/___.' >' \"\".\r\n" + 
				"#         | | :  `- \\`.;`\\ _ /`;.`/ - ` : | |\r\n" + 
				"#         \\  \\ `_.   \\_ __\\ /__ _/   .-` /  /\r\n" + 
				"#     =====`-.____`.___ \\_____/___.-`___.-'=====\r\n" + 
				"#                       `=---='\r\n" + 
				"#\r\n" + 
				"#\r\n" + 
				"#     ~~~~~~~~~~~~~~~(: Hello World :)~~~~~~~~~~~~~~~~~~\r\n" + 
				"#\r\n" + 
				"#               ä½›ç¥–ä¿ä½‘         æ°¸æ— BUG\r\n" + 
				"â€”ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½ï¿½?ï¿½\r\n";
		return d;
	}
	
	public static void main(String[] args) {
		welcome();
	}
	
}
